validation/coolantWaterMold/0/water/p
FoamFile { format ascii; class volScalarField; object p; }
dimensions [0 2 -2 0 0 0 0];
internalField uniform 0;
boundaryField
{
    inlet  { type zeroGradient; }
    outlet { type fixedValue; value uniform 0; }
    waterBottom { type zeroGradient; }
    water_to_mold { type zeroGradient; }
    defaultFaces { type empty; }
}
