validation/coolantWaterMold/constant/water/momentumTransport
FoamFile { format ascii; class dictionary; object momentumTransport; }
simulationType laminar;
