validation/coolantWaterMold/constant/water/physicalProperties
FoamFile { format ascii; class dictionary; object physicalProperties; }
viscosityModel constant;
nu    1e-06;

// Constant-property coolant thermo (constSolidThermo): supplies rho/Cv/
// kappa to the moldingCoolantFluid energy equation and the registered
// thermophysicalTransport required by the conjugate boundaries
thermoType constSolidThermo;
rho
{
    type        uniform;
    value       1000;
}
Cv
{
    type        uniform;
    value       4182;
}
kappa
{
    type        uniform;
    value       0.6;
}
